# MassGBXMLExportOptions Constructor (IList(ElementId)) (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassGBXMLExportOptions Constructor (IList<(Of <(<'ElementId>)>)>)
MassGBXMLExportOptions Class See Also
---
Constructs a new instance of the options used to export a mass model to gbXML.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public MassGBXMLExportOptions(
	IList<ElementId> massZoneIds
)
```

Visual Basic
---
```text
Public Sub New ( _
	massZoneIds As IList(Of ElementId) _
)
```

Visual C++
---
```text
public:
MassGBXMLExportOptions(
	IList<ElementId^>^ massZoneIds
)
```

# ### Parameters
massZoneIds
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> Indicates the mass zones to analyze in the exported gbXML.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MassGBXMLExportOptions Class
MassGBXMLExportOptions Overload
Autodesk.Revit.DB.Analysis Namespace